import Task1 from "./components/Task1/Task1";
import Task2 from "./components/Task2/Task2";
import Task3 from "./components/Task3/Task3";
import Task4 from "./components/Task4/Task4";
import Task5 from "./components/Task5/Task5";
import Task6 from "./components/Task6/Task6";
import Task7 from "./components/Task7/Task7";
import Task8 from "./components/Task8/Task8";

export const tasks = [
	{
		id: 1,
		title: "Задача 1",
		text: "З клавіатури вводиться довжина у сантиметрах. Виводити скільки це метрів, кілометрів.",
		Component: Task1,
	},

	{
		id: 2,
		title: "Задача 2",
		text: "З клавіатури вводиться температура. Змінювати колір фону у залежності від значення: менше нуля – білий, від 0 до 10 – синій, від 11 до 22 – зелений, вище 22 – червоний. Реалізувати з класами і стилями.",
		Component: Task2,
	},

	{
		id: 3,
		title: "Задача 3",
		text: "Вводиться дозволена швидкість і поточна швидкість авто. Якщо не введено дозволену швидкість, то елемент введення поточної швидкості заблокований. Якщо швидкість менше 50% дозволеної, то колір input – оранжевий, якщо від 50% до 100% - зелений, вище 100% - червоний. Якщо значення вище 90% починає блимати повідомлення «Увага!».",
		Component: Task3,
	},

	{
		id: 4,
		title: "Задача 4",
		text: "Дано список спортсменів. Потрібно сформувати список тих, які будуть брати участь у змаганні. При цьому є два стовпці. В одному відображені всі спортсмени, в іншому – список тих, хто був вибраний. При натисканні на зелену стрілку спортсмен переміщається у список для змагань. При натисканні на червону стрілку спортсмен переміщається у загальний список.",
		Component: Task4,
	},

	{
		id: 5,
		title: "Задача 5",
		text: "Пари для танців. Поступово вибираємо хлопця, дівчину і додаємо у обрані пари. Пару можна видалити. Поки не вибрано хлопця і дівчину кнопка «Додати» заблокована.  Якщо не вистачає хлопців або дівчат вибір також блокується.",
		Component: Task5,
	},

	{
		id: 6,
		title: "Задача 6",
		text: "Динамічний пошук. Є список працівників і поле пошуку. При введенні відображаються усі, які містять вказаний фрагмент",
		Component: Task6,
	},
	{
		id: 7,
		title: "Задача 7",
		text: "Дано список автомобілів (марка, рік випуску, ціна). Сформувати елементи для фільтрування з використанням випадаючого списку (контент цих випадаючих списків сформувати у залежності від переданого списку).",
		Component: Task7,
	},

	{
		id: 8,
		title: "Задача 8",
		text: "Перекладач. Користувачу виводять змішані картки з словами на англійській і українській мові. Користувач поступово клікає на картки (виділяємо синьою рамкою). Якщо знайдено правильні пари карток, що відповідають одному слову, то видаляємо ці картки. Інакше - виділяємо червоною рамкою і через секунду забираємо рамку.",
		Component: Task8,
	},
];
